print('Задача №7')
print('\tДан список lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]. \n\n\tНеобходимо вывести элементы, которые одновременно 1) меньше 30 и 2) делятся на 3 без остатка.\n\tВсе остальные элементы списка необходимо просуммировать и вывести конечный результат.')
lst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]
for i in lst:
    if i < 30 and i%3 == 0:
        print(i,end=';')
code = input("\nЕсли хотите увидеть код напишите 'code' ====>   ")
if code =='code':
    print(f"\nlst = [11, 5, 8, 32, 15, 3, 20, 132, 21, 4, 555, 9, 20]\nfor i in lst:\n\tif i < 30 and i%3 == 0:\n\t\tprint(i,end=';')\n\n")